class CommonPerson {
  final String img;
  final String text1;
  final MapEntry<String, String> about;
  CommonPerson({required this.img, required this.text1, required this.about});
}

List<CommonPerson> commonList = [
  CommonPerson(
      img: 'assets/images/common_person/1.jpg',
      text1: 'الملك جورج',
      about: const MapEntry('', '''عانى الملك جورج السادس، ملك بريطانيا، من
التأتأة، وصور ذلك "كولن فيرث" في الفيلم
الناجح "خطاب الملك" والذي رشح لجائزة
الاوسكار بعد ذلك .''')),
  CommonPerson(
    img: 'assets/images/common_person/2.jpg',
    text1: 'جوليا روبرتس',
    about: const MapEntry('', '''بسبب مشاكل مع أسرتها، عانت "جوليا
روبرتس" من التلعثم في الحديث، الامر الذي
جعلها تتحدث ببطء كي ال يالحظها أحد وتتعرض
لموقف محرج، ورغم معاناتها بسبب التأتأة الا
أنها تغلبت على ذلك وأصبحت من أشهر نجوم هوليود .'''),
  ),
  CommonPerson(
    img: 'assets/images/common_person/3.jpg',
    text1: 'مارلين مونرو',
    about: const MapEntry('', '''يتخذها الكثير من الفتيات حول العالم مثالا
للجمال، الا أنها رغم ذلك عانت من التأتأة في
الكالم من صغرها، وحاولت التغلب على ذلك
بأن تكون هي النجمة الاشهر على مستوى
العالم .'''),
  ),
  CommonPerson(
    img: 'assets/images/common_person/4.jpg',
    text1: 'مستر بين',
    about: const MapEntry('', '''عانى "مستر بين" صاحب أشهر كوميك، من
صغره من مرض التأتأة، واستطاع التغلب على
ذلك بالتمثيل بالاداء الصامت لدرجة أن الكثيرين
اعتقد أنه من الصم والبكم، ليتخذها ُسلم للنجاح حيث حقق شهرة واسعة.'''),
  ),
  CommonPerson(
    img: 'assets/images/common_person/5.jpg',
    text1: 'بروس ويلز',
    about: const MapEntry('', '''عانى النجم "بروس ويلز" من التعلثم من
سن 9 إلى 17 عا ًما، حتى عمل بالمسرح
واستطاع التغلب على المشكلة باحترافية.'''),
  ),
  CommonPerson(
    img: 'assets/images/common_person/6.jpg',
    text1: 'ستيف هارفي',
    about: const MapEntry('', '''الفنان الكوميدي والمقدم التلفزيوني
والاذاعي "ستيف هارفي" الذي أصيب به
منذ الصغر نتيجة طفولته البائسة ، وذكر في
إحدى لقاءاته أنه عندما كان في الصف
السادس تلقى سؤال من معلمه مضمونه
ماذا يطمح أن يكون عندما يكبر فأجاب أنه
لحالته ، وكان هذا
يطمح أن يكون على شاشة التلفاز، فسخر المعلم من جوابه نظرا
له في
الموقف حافزا نجاحه ليصبح من أشهر الالعالميين الامريكيين .'''),
  ),
  CommonPerson(
    img: 'assets/images/common_person/7.jpg',
    text1: 'نيكول كيدمان',
    about: const MapEntry('', '''الممثلة الاسترالية "نيكول كيدمان" كان أول
ظهور لها في السينما في عام 1983 ،ونالت
عدة جوائز أوسكار ، كانت مصابة بالتلعثم
نتيجة خجلها الزائد الذي استطاعت التخلي عنه الحقا .'''),
  ),
  CommonPerson(
      img: 'assets/images/common_person/8.jpg',
      text1: 'جو بايدن',
      about: const MapEntry('', '''يُنصب "جو بايدن" كأول رئيس متلعثم للولايات المتحدة، مجسدا حقيقة أن "التأتأة" ليست مشكلة عقلية تعيق صاحبها عن التقدم والابتكار والقيادة، ورغم أن المشكلة رافقت بايدن منذ كان بعمر 4 سنوات، فإنه نجح في تخطيها والتقدم للأمام ليؤكد بعد فوزه بمنصب الرئيس رقم 46 للولايات المتحدة أن التلعثم لا علاقة له بالقدرة العقلية .. 

''')),
  CommonPerson(
      img: 'assets/images/common_person/9.jpg',
      text1: 'جيمس ستيوارت',
      about: const MapEntry('', '''الممثل الامريكي "جيمس ستيوارت" الذي
أصيب بالتلعثم نتيجة تعرضه للسخرية الدائمة
من قبل زمالئه وأقربائه، واستطاع أن يتغلب
على هذه الحالة بتدريب نفسه على تمارين
الثقة أمام الكاميرا.''')),
  CommonPerson(
      img: 'assets/images/common_person/10.jpg',
      text1: 'صامويل',
      about: const MapEntry('', '''الممثل الامريكي "صامويل جاكسون" كان
ً من التلعثم في صغره ولكن
يعاني أيضا
استطاع التغلب عليه ، وصرح في إحدى لقائاته
قائالً "كنت أعاني من التلعثم في طفولتي ،
ولم يكن يتوقع أحد وقتها أن أصل إلى ما أنا
عليه اآلن" ، ويضيف النجم الامريكي موضحا أن
سخرية الاطفال منه دفعته للتركيز في
دراسته حتى ينتقم منهم بحصوله على درجات أعلى في المدرسة.
إنه يعاني في بعض الاحيا
كما صرح أيضا ن من تلك الحالة القديمة، كما حدث أثناء
تصوير بعض مشاهد فيلم "كابتن أمريكا" عندما بدأ التصوير ثم أصابته الحالة القديمة
ولم يستطع النطق بشكل سليم وقتها.''')),
];
