import 'package:fares_pro/amr_view/widgets/reuseable_screen.dart';
import 'package:fares_pro/view/pdf_screen/pdf_screen.dart';
import 'package:fares_pro/view/screens/Sound_disturbances/widgets/default_screen.dart';
import 'package:fares_pro/view/screens/pdf_view_screen/pdf_viewer.dart';
import 'package:flutter/material.dart';
import 'package:pdfx/pdfx.dart';

import '../../../service/responsive.dart';
import '../../widgets/introduction_to_communication_science_button.dart';

class SoundDisturbances extends StatelessWidget {
  const SoundDisturbances({Key? key}) : super(key: key);
  static String id = 'sounded';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: const Text(
          'اضطرابات الصوت',
          style: TextStyle(fontSize: 26),
        ),
      ),
      body: Stack(

        children: [
        Image.asset(
        'assets/images/back4.jpg',
        width: double.infinity,
        height: double.infinity,
        fit: BoxFit.fill,
      ),

          SingleChildScrollView(
            child: Column(
              children: [
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(
                            title: 'تعريف الصوت ',
                            listOfRichTextWidget: const [
                              MapEntry(
                                '',
                                'هو ما يصدر عن الحنجرة نتيجة اندفاع الهواء المضغوط أسفل الثنايا الصوتية مما يجعلها تنفرج فجاه وهو موجود لدى الانسان والحيوان وهو الموجه الحاملة للاتصالات اللفظية وهو ينتج عن اهتزاز الثنايا الصوتية بالحنجرة ويتم هذا اثناء خروج هواء الزفير وهو ما نطلق عليه الصوت الحنجري الأولي وتعتمد سلامته على التركيب السليم للحنجرة. '
                                  )
                            ]);
                      },
                    ));
                  },
                  text: '  تعريف الصوت ',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(
                          title: ' متطلبات اخراج الصوت الجيد',
                          listOfRichTextWidget: [
                            MapEntry(
                              "",
               ''' لكي يتم اصدار صوت سليم نحتاج لتواجد عده متطلبات وإذا غاب أحدها اختل الصوت وهي:                   
1)	عوامل متعلقة بسلامه الحنجرة.  
2)	عوامل متعلقة باستخدام الشخص للحنجرة.                           
3)	عوامل خاصه بالتنفس.                  
'''                  )
                          ],
                        );
                      },
                    ));
                  },
                  text: ' متطلبات اخراج الصوت الجيد',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          MapEntry(
                            '',
                 ''' من الناحية الفسيولوجية الوظيفية تعتبر الحنجرة هي المسؤولة عن اصدار الصوت بالإضافة الى وظائف الحنجرة الاخرى لأنها جزء من الجهاز التنفسي العلوي وهي الحارس الامين الذي يحمينا من دخول الاجسام الغريبة الى الجهاز التنفسي وما يمكن ان يؤدي الى حدوث اختناق فهي خط حمايه هام واثناء البلع تغلق الحنجرة تماما بواسطه الثنايا الصوتية فتمنع دخول الطعام او الشراب الى جهاز التنفسي وهذه وظيفه حمايه هامه كما  ان الحنجرة مسؤوله عن زياده ضغط الهواء بداخل القفص الصدري وذلك هام جدا الامور كثيرا منها الولادة ومن هنا يتضح لنا ان الحنجرة هي  جزء هام وحساس لذلك لابد ان تعلم كيفيه الحفاظ عليها
	وظيفة البلع: 
تقوم الحنجرة بعمل دفاعي هام جدا حيث تنغلق عند ابتلاع الطعام لتمنع سقوطه في الطريق الهوائي وإذا دخل جسم خارجي فينتج رد فعل منعكس وهو السعال.                               
	وظيفة التنفس: 
الحنجرة هي طريق الهواء الى الرئتين وبما ان التنفس عمليه حيوية تتمثل في مرحلتين هما الشهيق والزفير فيما يمتلئ الصدر بالهواء في المرحلة الاولى ويفرغ منه في المرحلة الثانية ثم يعود الى حجمه فان الحنجرة لا تكون مستقرة في العنق خلال التنفس حيث تنزل عند الشهيق تحت تأثير تشنج عضله القصبة خصوصا بقوة سحب انبوبة التنفس.    
	وظيفة لفظيه: 
يعتبر الدكتور حنفي بن عيسى عمليه التصويت كونها اشبه ما تكون عمليه انبعاث الأنغام عن اله موسيقية ذات اوتار مهتزة وتتمثل الوظيفة اللفظية اهم وظائف الحنجرة فعملها التصويتي يتم بفعل تقارب الاحبال الصوتية من بعضها ويتم تحويله الى كلام بفضل اعضاء النطق.         
'''              )
                        ], title: ' الحنجرة');
                      },
                    ));
                  },
                  text: ' الحنجرة',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          const MapEntry(
                            "",
                '''عندما تصاب الحنجرة لاي سبب من الاسباب نجد المريض يعاني من:                
1)	صعوبة في التنفس قد تصل الى حد الاختناق.       
2)	صعوبة في البلع قد يصاحبها مرور الطعام او الشراب الى الجهاز التنفسي.  
3)	حدوث ألم عند استخدام الحنجرة ٤بحه الصوت 
'''            )
                        ], title: ' اعراض إصابة الحنجرة ');
                      },
                    ));
                  },
                  text: ' اعراض إصابة الحنجرة ',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          MapEntry(
                            '',
               '''     وهي التي تنتج عن اصابات الحنجرة:     
1)	جرح قطعي او ضربه قوية موجهه الى الرقبة.
2)	اصابات فيزيائية مثل الحرق الحراري او الكيميائي او الاشعاعي.
3)	التهاب الحنجرة سواء كان التهاب حاد او مزمن.                     
4)	حساسيه الحنجرة.
5)	 اورام الحنجرة سواء الحميدة او الخبيثة. 
6)	اضطرابات عصبيه سواء حركيه او حسيه.             
7)	اضطراب الغدد الصماء مثل الغده الدرقية جار الدرقية - النخامية.
8)	الأدوية التي تحتوي على هرمونات الذكورة وتغيرات ما قبل سن اليأس.    
'''               )
                        ], title: 'عيوب مكتسبه بالحنجرة');
                      },
                    ));
                  },
                  text: 'عيوب مكتسبه بالحنجرة',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          MapEntry(
                            '',
             '''1)	حبيبات صوتيه.      
2)	لحميه الثنايا الصوتية غالبا ما تصيب الذكور عاده ما تكون على ثنيه صوتيه واحده.            
3)	اكياس الثنايا الصوتية، تصيب عادة البالغين من الجنسيين.                              
	وتنقسم الي:                    
•	اكياس حقيقيه سواء كانت خلقيه او نتيجة تجمع وبقاء افرازات في الغدد المطاطية.                                  
•	شبيهة الاكياس نتيجة تحلل في ورم غددي او ورم ليفي او لحميه او تجمع دموي. 
 
'''               )
                        ], title: ' أسباب عضوية اخري ');
                      },
                    ));
                  },
                  text: ' أسباب عضوية اخري ',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(title: ' الاستئصال الحنجري',
                            // ignore: prefer_const_literals_to_create_immutables
                            listOfRichTextWidget: [
                              MapEntry(
                                '',
                                 '''تكلمنا عن الحنجرة ووظائفها وبعض الامراض والمشاكل التي تؤثر على عملها ونتطرق الان الى موضوع تأثير (استئصالها) وعن كيفية تأهيل المريض بعد ذلك.                              
  يتم استئصال الحنجرة لبعض حالات الاورام الخبيثة التي تصيب الحنجرة ويكون هذا الاستئصال خطوه اولى في خطوات العلاج قد يليه علاج اشعاعي او علاج كيميائي وينتج عن ذلك الاستئصال فقدان المريض لعضو اصدار الصوت وبالتالي يفقد صوته ولا يستطيع التخاطب لذا يفضل في الحالات المبكرة لسرطان الحنجرة ان يتم الحفاظ عليها قدر الامكان. 
	المشاكل التي يواجهها مريض الاستئصال الحنجري:.  
    يعاني مريض الاستئصال الحنجري من العديد من المشاكل اهمها:            
1)	فقدان تام للصوت وعدم القدرة على الحديث.                         
2)	الاحباط والاكتئاب الشديد وأحيانا يكون ذلك سبب رفضه لأجراء العملية.            
3)	فقدان حاسة الشم والتذوق بشكل مؤقت.                              
4)	صعوبة البلع مع صعوبة السعال.
5)	عدم تقبل المريض في بدأيه الامر فكره وجود تلك الفتحة برقبتها كذلك يضايقه كثرة الافرازات التي تخرج منها.                                      
6)	احيانا يشعر المريض بالتعب لأقل مجهود.   
	علاج مريض الاستئصال الحنجري:   
	اولا: إعداد المريض قبل الجراحة:
•	يجب اعداد المريض واسرته اعدادا جيدا قبل الجراحة
•	لابد ان نضع في الاعتبار ان لديه قلق وتساؤلات واستفسارات حول الجراحة وما يليها. فاهم ما يشغله هو كيف يتكلم بعد الجراحة وما هي فرص الشفاء وكل هذه الأسئلة تحتاج لإجابات بسيطة ومطمئنه حتى يقل القلق لدى المريض.                                      
	ثانيا: تأهيل مريض الاستئصال الحنجري تخاطبيا:                   
1)	طريقه الكلام المريء: يحدث عندما يقوم المريض بحقن الهواء في الجزء العلوي من المريء ويتحكم 
بإخراجه عندها تصل الذبذبات والاهتزازات الى البلعوم ثم المريء محدثا الصوت المطلوب في عمليه الكلام. 
	مميزات استخدام الكلام المريئ:         
1)	لا تكلف اي ثمن.            
2)	الحصول على صوت قريب من الصوت الطبيعي.              
3)	لا يحتاج الى جهاز او صيانة.         
4)	لا يتطلب أي عمليات جراحيه.
	مساوئ استخدام الكلام المريئ:        
    صعوبة تعلم طريقه الكلام المرييء، نسبه النجاح المتوقعة للحصول علي صوت طبيعي لا تتجاوز ٢٥%. 
2)	 الحنجرة الإلكترونية: عباره عن جهاز مصمم لمساعده المرضي على استعاده القدرات الكلامية بأكبر قدر ممكن من السهولة والوضوح.          
•	طريقه عمل الجهاز: عندما يضع المريض هذا الجهاز على منطقه العنق ويقوم بالضغط على قرص التشغيل الخاص بأحداث الصوت فيقوم الجهاز بإصدار ذبذبات عبر تجاويف الحلق والفم وبعد ذلك يصدر الكلام عن طريق حركات الفم العادية.                
	مميزات استخدام الحنجرة الإلكترونية:        
- استعاده الصوت.  		   	 - علو الصوت.  		  - سهوله التحكم والاستخدام.   
- امكانيه استخدامه في الضوضاء وعند التحدث عبر الهاتف.        
	مساوئ استخدام الحنجرة الإلكترونية:       
- غلاء ثمن الجهاز.    		- الصوت الناتج يشبه صوت الرجل الالي مما يشتت انتباه السامع.      
	 دور اخصائي التخاطب بعد عمليه الاستئصال:                          
1)	تبدأ معالجه التخاطب بطريقه الحنجرة الإلكترونية في نفس اسبوع العملية وبالطرق الاخرى خلال اسبوعين بعد العملية.  
2)	التأكد من معرفه المريض وفهمه لاستخدام وسيله النطق المختارة.
3)	تحسن صوت المريض يعتمد على الجلسات التي يحضرها وممارسته للتدريبات المعطاة من قبل الاخصائي بالمنزل.   
4)	 التدريب بصوره يوميه (لا تقل عن ساعتين تدريب). 
5)	 حماية الحنجرة باستمرار و منع المريض من استخدام ورق المناديل لا زاله الافرازات لأنه يؤدي لالتهابات وهيجان تلك المنطقة.       
	هناك بعض التغيرات التي ستطرأ على حياه المريض بعد استئصال وهي : 
عمليه التنفس مباشره بعد العملية سيلاحظ المريض حدوث التغيرات وذلك ان الهواء الذي سوف يستنشق لا يصبح دافئ ونقي (مفلتر) كما في السابق ويمكن ان يحدث التهاب الشعب الهوائية.
•	حاسة الشم والتذوق: تتأثر كل من حاسة الشم والتذوق خاصة إذا كان المريض تحت العلاج بالأشعة وذلك لعدم قدرته على استنشاق الهواء عن طريق الأنف ولكن سرعان ما تعود. 

'''),

                            ]);
                      },
                    ));
                  },
                  text: ' الاستئصال الحنجري',
                  clr: Colors.teal,
                ),
                // IntroductionToCommunicationScienceButton(
                //   onTap: () {},
                //   text: 'تأهيل مرض الاستئصال الحنجري',
                //   clr: Colors.teal,
                // ),
                // IntroductionToCommunicationScienceButton(
                //   onTap: () {},
                //   text: 'تشخيص حالات تأخر النمو اللغوي ',
                //   clr: Colors.teal,
                // ),
                // IntroductionToCommunicationScienceButton(
                //   onTap: () {},
                //   text: 'تصميم خطة لعلاج تأخر النمو اللغوي',
                //   clr: Colors.teal,
                // ),

                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'إرشادات خاصة بالصوت',
                        //     pageRange: const MapEntry(24, 27),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 24,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'البحة الصوتية',
                            listOfRichTextWidget: [
                              MapEntry('', '''هي تغير في طبقة الصوت الخام أو الأصلي المعتاد لمدة لا تزيد عن أسبوعين 14 يوم، وحينئذ يتم الذهاب لطبيب الأنف والأذن والحنجرة الذي يقوم بعمل الفحوصات اللازمة، لنتعرف على الأسباب التي يمكن أن تكون عضوية أو وظيفية كما ذكرنا:
	 أسباب حدوث البحة الصوتية:
	عضوية:  
1-	 کيس دهنی.  		2- حبيبات   			3- التهابات 		4- صدمات وحوادث 
5- أورام.			6- اضطرابات الغدد		7- لحمية الثنايا الصوتية  
	وظيفية:
1)	استخدام خاطئ مكثف للصوت.	         2) اسباب نفسية.
 ۳) اجهاد عضلات الحنجرة			4) التعرض لغبار الأبخرة المهيجة والهواء لفترات طويلة.

	اشكال البحة الصوتية:
1)	بحة صوتية فوق وظيفية (الصراخ): وتشتمل جميع أنواع الشد العضلي الزائد للقناة الصوتية ويكون نتيجة الاستخدام الخاطئ للصوت والصراخ مما يؤدي إلى انقباض كل عضلات إصدار الصوت بالإضافة إلى عضلات التنفس ويشكو المريض من تغير صوت.
2)	بحة صوتية تحت وظيفية (الهمس): وجد أن استخدام الصوت بصورة منخفضة مبالغ فيها (الهمس) ينتج عنه ضعف في العضلات مع ضعف الصوت ويكون خافتا ومصحوب بالهراء.
3)	بحة صوتية طفولية: وهي تحدث عند الأطفال الذين يميلون للصراح والعويل طوال اليوم في حين أنهم في حالة عضوية جيدة وهذا الإجهاد الصوتي مصحوب بتغير في الطابع الذي يصبح غليظ واجش أو حاد 
	الأعراض :
الأعراض الذاتية: في أغلب الأحيان الطفل لا يكون واعي بالبحة وهي لا تزعجه ولا يرى ضرورة للاهتمام بصوته، وحتى الآباء لا نراهم يولون أهمية كبيرة لبحة الأطفال وعند بعض الحالات يشكو الطفل من انزعاج فهو يشعر أن صوت يخرج بصعوبة.
أعراض موضوعية: في صوت الحوار الإصابة تكون مهمة ومختلفة وتتميز بما يلي:
1)	يكون الصوت غليظ. 		
2)	نهاية الجمل تكون أحيانا مخنوقة.
3)	الطابع أجش. 		
4)	صوت القراءة يكون أكثر إصابة من صوت الحوار.
	 الوهن الصوتي: 
هي صورة من صور البحة الصوتية الوظيفية وهناك من يصنفه كمشكلة قائمة بذاتها وله أعراض عديدة وهي: 
1)	جفاف الحلق						2) ألم في الحلق 
3) رغبة متكررة في طرد البلغم (نحنحة متكررة) 	4) إحساس كاذب بوجود جسم غريب بالحلق) 
5) عدم القدرة على مواصلة الكلام بعد فترة من بدئه نتيجة إرهاق الصوت وعادة ما تكون اعراضه غير اثناء النهار الباكر ثم تزيد بعد فترة من استخدام الصوت موجودة
6) يحدث في حالة عدم استخدام الحنجرة لفترات طويلة
7)  يحدث في حالة عدم شرب السوائل حيث يحدث جفاف للحنجرة 
8) الوهن الصوتي يظهر ويختفي على فترات يتم فيها استخدام الصوت بطريقة خاطئة 


'''),

                            ]);
                      },
                    ));
                  },
                  text: 'البحة الصوتية',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'إرشادات خاصة بالصوت',
                        //     pageRange: const MapEntry(24, 27),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 24,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'الطفرة غير مكتملة النمو',
                            listOfRichTextWidget: [
                              MapEntry('', ''' هو عدم قدرة الفرد على التغير أو الانتقال من الطبقات العليا إلى المنخفضة عند سن البلوغ ويحدث للذكور فقط فينتاب المراهق الشعور بعدم التكيف في صوته وإذا لم يحصل تكيف مع هذا التغير فإنه يحتفظ بصوت صبياني وحاد.                         
	التشخيص: هو دور الطبيب المختص وبعد عمل المنظار يؤكد أن الحنجرة طبيعية وهي مشكلة وظيفية وليست عضوية. 
	الأسباب: عدم تكيف المريض مع الصوت الجديد وإحساس عميق بالخوف من تحمل المسئولية.        
	العلاج:     
  1- التطمين.  			 2- التأكيد على أن العلاج بيد الشخص نفسه.
	 تدريبات الصوت :
 وضع يد الأخصائي أو المريض نفسه على الحنجرة ودفعها إلى أسفل (برفق) ثم يطلب من المريض إصدار الصوت حتى يعرف هذا الصوت الجديد.
1)	أكد على المريض بأن الصوت الجديد هو صوته الحقيقي.
2)	أطلب من الشخص أن يحاول الاحتفاظ بهذا الصوت.
3)	أطلب من الشخص أن يبدأ في استخدام صوته الجديد في النطق العدد مثلا (١٠: ١) ثم أيام الأسبوع.
4)	أطلب من الشخص أن يبدأ في استخدام صوته الجديد في قراءة مقاطع صغيرة في مقالة مثلاً
5)	أطلب من الشخص أن يبدأ في استخدام صوته الجديد في مقالة كاملة.
6)	أطلب من الشخص أن يبدأ في استخدام صوته الجديد في الحديث التلقائي. 
7)	أطلب من الشخص أن بيدا في استخدام صوته الجديد في حوار مفتوح.
8)	اطلب من الشخص أن يبدأ في استخدام صوته الجديد في حياته اليومية. 
	 إنهاء التدريب :
 ينتهي التدريب عندما يصدر الشخص صوته الطبيعي ويرضى عن صوته ولا تملك ما نقدمه له بعد لك - قد يتحسن المريض تماما - عادة يحتاج الشخص جلسة واحدة لإصدار الصوت الطبيعي ثم من ( 3-5 ) جلسات للتأكيد. 


''')

                            ]);
                      },
                    ));
                  },
                  text: 'الطفرة غير مكتملة النمو',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'إرشادات خاصة بالصوت',
                        //     pageRange: const MapEntry(24, 27),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 24,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'فقدان الصوت الهستيرى',
                            listOfRichTextWidget: [
                              MapEntry('', '''فقدان مفاجئ مؤقت للصوت ويحدث بدون سبب عضوي حيث يفقد المريض الصوت تماماً لفترة معينة ويكون
لهذا سبب نفسي واضح أو ضغط نفسي شديد (وغالبا ما يكون من السيدات) وعادة لا تتأثر الوظائف المصاحبة
للحنجرة كالسعال أو الضحك أو البكاء.       
	التشخيص: هو دور الطبيب المختص وبعد عمل المنظار يؤكد أن الحنجرة طبيعية لذلك فهو اضطراب وظيفي وليس عضوي.
	السبب: ضغط نفسي مفاجئ، ويصيب الإناث عادة في سن ۱۸ - ۳۸ علم وغالبا حول سن الياس 55 سنة تقريبا تستطيع المريضة أحيانا أن تهمس بالإضافة إلى أن صوت البكاء طبيعي وصوت الضحك طبيعي.
	العلاج: التطمين       
	تدريبات الصوت: 
1)	خلال جلسة أو أكثر نسترجع الصوت ونثبته لمنع تكرار ذلك. 
2)	استخدام أصوات ابتدائية لإصدار الصوت مثل الكحة أو النفخة. 
3)	أضف لهذا الصوت بعض الأصوات مثل / و. 
4)	كرر الأمر ثم ادخل بعض الكلمات البسيطة وهكذا.
5)	لقد تم استرجاع الصوت. 
	إنهاء التدريب: 
ينتهي التدريب عندما يصدر المريض صوته الطبيعي ويرضي عن صوته ولا تملك ما نقدمه له بعد ذلك يتحسن المريض تماما وعادة يحتاج لجلسة واحدة لإصدار الصوت الطبيعي ثم من جلسة إلى جلستين التأكيد لا تطل ولا تكثر الجلسات حتى لا تعتمد المريضة نفسيا على المعالج.


'''),

                            ]);
                      },
                    ));
                  },
                  text: 'فقدان الصوت الهستيرى',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'إرشادات خاصة بالصوت',
                        //     pageRange: const MapEntry(24, 27),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 24,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'إرشادات خاصة بالصوت',
                            listOfRichTextWidget: [
                              MapEntry('', '''•	كيفية تشخيص أمراض الصوت
•	العلاج السلوكي لتعديل الصوت.     
•	إرشادات للصوت الصحي (الاسترخاء افعل – لا تفعل).       
•	تدريبات التنفس باستخدام عضلات البطن.   
•	تدريبات إصدار الصوت.  
•	التدخين وأثره على الحنجرة.

	كيفية تشخيص حالات أمراض الصوت : 
-	التنظير الحنجري غير المباشر (المرآه)  
-	المنظار الحنجري الصلب   
-	المنظار الأنفي الحنجري المريء 
	العلاج السلوكي لتعديل الصوت: يستخدم هذا الأسلوب مع مريض تغير الصوت والذي تم تشخيص حنجرته من قبل الأطباء المختصين كحنجرة طبيعية عضويا، وتحتاج هذا الأسلوب في العلاج دون غيره من جراحة أو علاج دوائي، أي أنه أسلوب علاج مخصص لحالات ( تغير الصوت الوظيفي ).
	وهو مجالين رئيسيين: 
۱- ارشادات للصوت الصحي 
2 - تدريبات لتصحيح عادات استخدام الصوت الخاطئة ( طريقه سميث اكسنت )
	 ارشادات للصوت الصحي:
	 الاسترخاء: 
-	تدريبات التنفس للاسترخاء
-	استرخاء أعضاء الكلام مع طريقة اكسنت
-	استرخاء عضلات الجسم ككل بما في ذلك الوضع الصحيح للرأس والعنق والأكتاف 
-	التدريبات الصوتية تعديل السلوك الصوتي وتتضمن خطة تعديل السلوك بالإضافة إلى تدريبات الصوت ذاتها. 
	إرشادات للمريض فيما يتعلق بالوسائل الصحيحة بالصوت وذلك من خلال ( افعل ولا تفعل ) 
	لا تفعل: 
1) ما يؤدي صوتك 					2) الصراخ والكلام بصوت عال
 3) الكلام من مسافات بعيدة				4) الكلام أثناء الضوضاء 
5) كثرة النحنحة والهمهمة والكحة الشديدة 		6) الضحك والبكاء بصوت عال
 7) التعرض لعادم السيارات				8) الخروج في يوم عاصف 
9) الكلام بسرعة وبدون أخذ النفس الكافي 
10) الكلام لعدد كبير من المستمعين مع عدم استخدام ميكرفون
 11) التدخين وتناول الكحوليات أو الأكلات الحارة أو مخالطة مدخنين مع استنشاق دخان السجائر
12) المناداة
 13) السوائل التي تحتوي على مادة الكافيين مثل ( المياه الغازية - الكاكاو - النسكافيه - الشاي - القهوة )

	افعل:
1)	ما يحافظ على صحة وسلامة صوتك 
2)	التعود على شرب كمية كبيرة من السوائل في اليوم على ألا تشتمل على المشروبات التي تحتوي على الكفايين ( الشاي _القهوة _الكولا )
3)	استخدام إشارات من أجل لفت نظر من هو على بعد بدلا من استخدام الصوت 
4)	 تقليل الضوضاء في البيئة المحيطة قدر الإمكان قبل تبادل الحديث أو أن يكون الإقتراب مع من تتحدث
5)	علاج نزلات البرد والسعال
6)	استخدام ميكرفون للحديث في مكان متسع مثل ( قاعات المحاضرات )
7)	إعطاء الصوت فترات من الراحة قدر الإمكان على مدار اليوم  )
8)	المبادرة باستشارة الطبيب عند ظهور أي علامات مرضية خاصة بالصوت مثل البحوحة أو ألم الحلق أو عند وجود نزلة برد أو حساسية بالجهاز التنفسي العلوي أو السعال ويعتمد تأهيل مرضى الصوت على التأهيل الصوتي من خلال طريقة سميث الاستخدام التنفس البطني أثناء الكلام )
	طريقه سيمث اكسنت: ابتكرها سيفند  سمیث عام  ١٩٣٦في  تدريبات الصوت والتلعثم والحبسة الكلامية وهي ثلاث مراحل متداخلة : 
 ا - التنفس باستخدام عضلات البطن    
ب - تدريبات الصوت ثم النطق  
    ت - حركات الجسم والذراعين 
 لابد من التأكيد على كونها الأسلوب الفسيولوجي الأمثل للتنفس، وعليه يفضل الاستمرار عليها حتى بعد نهاية الجلسات لأنها أسلوب حياة.
	 التحضير لتدريبات التنفس :
 وضح للمريض أن علاقة النفس بالحنجرة كعلاقة موتور السيارة بالبنزين هو سر أثر الموتور في تحريك السيارة وكذلك هواء الزفير هو الذي يحرك الثنايا الصوتية وينقل الموجات الصوتية عبر مجرى الصوت إلى الخارج، وعليه فكلما ضبطنا النفس كلما ضبطنا الصوت
	 وطريقة التنفس باستخدام عضلات البطن تسمح للمريض بالمزايا الآتية: 
- توفر للمريض كمية أكبر من الهواء لأن التجويف البطني أكبر من التجويف الصدري 
- تقلل من الضغط على عضلات الرقبة والأكتاف والصدر 
- تساعد الشخص على التحكم بشكل أفضل في هواء الزفير وهذا يساعد على التحكم في إصدار الصوت 
- تساعد الشخص على الاسترخاء
	 تدريبات التنفس باستخدام عضلات البطن : 
1)	تنشيط عضلات البطن والأجناب والتحكم بهم هو أساس التدريب. 
2)	ينام الشخص على ظهره على أرض صلبة نسبيا وتحت ركبته وسادة لترتخي عضلات بطنه. 
3)	يبدأ الشخص في تحريك عضلات بطنه للداخل والخارج مع وضع كتاب عليها لتزداد الحركة وضوحا. 
4)	يأخذ الشخص نفسه من أنفه ويخرج الزفير من فمه بدون صوت.
5)	بعد أن بألف هذا الجزء من التدريبات تنتقل للجزء التالي.
6)	يمكن الآن رفع الكتاب ووضع اليد على البطن بدلا من الضغط على عضلات البطن. 
7)	بعد ذلك يؤدي الشخص التدريبات جالسا على كرسي مناسب 
8)	يمكن للمعالج أن يساعد الشخص على ضبط إيقاع التنفس بالنقر على طاولة مثلاً 
9)	يمكن للمعالج أن يساعد الشخص على فهم التدريب بتمثيل المشهد أمامه أو عرض فيديو مثلاً 
10)	 يمكن للمعالج أن يساعد الشخص على فهم التدريب بوضع يده على بطنه أثناء تمثيل المشهد 
11)	بعد ذلك يؤدي الشخص التدريب واقفا على قدمان متباعدتان قليلا ويداه تتأرجحان للخلف وللأمام كما لو كان يمشي 
12)	يجب مراعاة أن توفر برهة مناسبة بين الشهيق والزفير تمهيدا لتوافرها أثناء الكلام بين الجمل
	تدريبات اصدار الصوت: 
	التحضير: 
- بعد أن يجيد الشخص تدريبات التنفس باستخدام عضلات البطن نضيف صوتا يطلقه الشخص مع الزفير 
- ( ف ) هو أول صوت يطلقه الشخص مع الزفير وتطلب من الشخص أن يشعر بالهواء عند الشفاه 
- ثم الصوت ( س ) ثم الصوت ( ش ) 
- بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد مرتين دون فاصل مع تأكيد وإطالة الصوت الثاني 
- بعد ذلك يضيف الشخص ( V ) ثم الصوت ( ز ) ثم الصوت ( ج ) 
- احرص دوما أن تكون علاقتك بالشخص بين إرشاد ومتابعة استجابة 
	اصدار المتحركات: 
1)	بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الثاني مرتين دون فاصل مع تأكيد وإطالة التكرار التالي
2)	بعد أن يجيد الشخص هذا الجزء من التدريب جالسا يبدأ في تنفيذه في وضع الوقوف كما في تدريبات التنفس 
3)	بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد 3 مرات دون فاصل مع تأكيد وإطالة الصوت الأخير 
4)	بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد 4 مرات دون فاصل مع تأكيد وإطالة الصوت الأخير
5)	بعد أن يحيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد 5 مرات دون فاصل مع تأكيد وإطالة الصوت الأخير
6)	وهكذا حتى يصدر الشخص أكبر عدد من الأصوات متبادلا فيما بينها 
7)	يجب التأكيد على الاسترخاء في كل مراحل التدريب
8)	بعد أن يجيد الشخص ما مضى من أجزاء يبدأ في استخدام هذا الأسلوب الإيقاعي في النطق العد مثلا 
( ۱-10) ثم أيام الاسبوع 4 )
9) بعد أن يجيد الشخص هذا الجزء من التدريب بيدا في استخدام هذا الأسلوب الإيقاعي في قراءة مقاطع قصيرة من مقالة مثلاً 
10)  بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في استخدام هذا الأسلوب الإيقاعي في قراءة مقالة كاملة
11)  بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في استخدام هذا الأسلوب الإيقاعي في حوار مفتوح 
12)  بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في استخدام هذا الأسلوب الإيقاعي في حياته اليومية في مختلف المواقف

	إنهاء التدريب: 
1)	ينتهي التدريب عندما يستعيد الشخص صوته الطبيعي ويرضي عن صوته ولا نملك ما نقدمه له بعد ذلك 
2)	قد يتحسن الشخص تماماً وقد يتحسن بشكل نسبي كل حسب حالته وانتظامه واتباعه للإرشادات
3)	عادة تغيرات الصوت لأسباب وظيفية تحتاج من ٢٠-٢٥ جلسة، الجلسة ۲۰ دقيقه من ٢-٣ جلسات اسبوعيا     
 
      
	التدخين وأثره على الحنجرة:
 1) يتسبب في أمراض كثيرة منها (سرطانات الحنجرة والرئتين - بحة الصوت - حساسية الصدر وخاصة لدى الأطفال نتيجة التدخين السلبي). 
۲) يؤدي إلى جفاف الغشاء المطاطي بداية من الشفاه والأنف ومرورا باللسان ثم الجهاز التنفسي .
3) ٩٥% من حالات سرطان الحنجرة سببها المباشر التدخين
 4) دخان السجائر يحتوي على مواد سامة وضارة لأي نسيج مثل (أول اكسيد الكربون ماده الفرفوال الكحول المثيلي في دخان الشيشة)
5) بسبب الدخان الناتج تتمدد الشعيرات الدموية بالحجرة وبالتالي سهولة انفجارها وحدوث نزيف مؤدياً لتكوين حبيبات أو لحميات او اكياس أو تجمع دموي في بعض الأحيان
 6) سرعة الصوت في الماء تزيد 4 مرات عن سرعة انتقاله في الهواء
 ۷) صوت الحوت يمكن أن ينتقل المسافة تصل إلى 800 كيلو متر في مياه المحيط 
۸) سرعة الصوت أقل من سرعة الضوء لذلك يظهر البرق أولا ثم الرعد
 ۹) لا يوجد صوت على سطح القمر لأنه ببساطة الصوت يحتاج إلى أشياء يعبر من خلالها كالهواء أو السائل وهذا غير متوفر على سطح القمر
 ١٠) يحنث صدى الصوت عند اصطدام الصوت بشيء.

'''),

                            ]);
                      },
                    ));
                  },
                  text: 'إرشادات خاصة بالصوت',
                  clr: Colors.teal,
                ),
                SizedBox(
                  height: SizeConfig.defaultSize * 1,
                )
              ],
            ),
          ),
        ],
      ),
    );
  }
}
